#include <iostream>
#include <windows.h>
#include "university.h"

using namespace std;

int main() {
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);

    cout << ">>> ЕТАП 1: Просте наслідування та блоки пам'яті (Деструктори) <<<\n";
    cout << "------------------------------------------------------------\n";
    { // Штучний блок для відслідковування входження та виходу об'єктів
        cout << "[ ВХІД У БЛОК 1 ]\n";
        Student s1("Блаута Віка", 19, "vika@ukr.net", 1122, "вул. Франка, 10", "0991112233", 
                   5501, "Комп. Інженерія", "КІ", 4.8);
        s1.displayStudentInfo();
        cout << "[ ВИХІД З БЛОКУ 1 ]\n";
    } // Тут автоматично спрацює деструктор Student, а потім Person
    cout << "\n";


    cout << ">>> ЕТАП 2: Закрите наслідування (Клас Dean) <<<\n";
    cout << "------------------------------------------------------------\n";
    Dean d1("Василенко Петро", 55, "dean@ukr.net", 9988, "вул. Шевченка, 1", "0670001122", "КІ", 305);
    d1.displayDeanInfo();
    // cout << d1.name; // ПОМИЛКА! Поле name стало private через закрите наслідування.
    cout << "\n";


    cout << ">>> ЕТАП 3: Множинне наслідування (Клас Professor) <<<\n";
    cout << "------------------------------------------------------------\n";
    // Створення професора викличе конструктори Person, Employee, Researcher, і лише потім Professor
    Professor p1("Коваленко Іван", 45, "prof@ukr.net", 3344, "вул. Лесі Українки, 5", "0509998877",
                 777, 45000.0, "Доцент", 
                 "Кібербезпека", 15, 8, 
                 "К.т.н.", "Мережі");
    p1.displayProfessorInfo();
    cout << "\n";


    cout << ">>> ЕТАП 4: Сценарій функціонування системи <<<\n";
    cout << "------------------------------------------------------------\n";
    Student s2("Петренко Олег", 20, "oleg@ukr.net", 2233, "вул. Миру, 2", "0637778899", 
               5502, "КІ", "КІ", 2.5);
    
    cout << "\t[*] Стан до сесії:\n";
    s2.displayStudentInfo();
    
    // Професор ставить оцінку студенту
    p1.gradeStudent(s2, 4.6);
    
    cout << "\t[*] Стан після сесії:\n";
    s2.displayStudentInfo();
    if(s2.hasScholarship) cout << "\t[+] Декан: Студенту призначено стипендію!\n";
    else cout << "\t[-] Декан: Студент без стипендії.\n";

    cout << "\n============================================================\n";
    cout << "   ЗАВЕРШЕННЯ ПРОГРАМИ (Глобальне очищення пам'яті)         \n";
    cout << "============================================================\n";

    cin.get();
    return 0;
}